In [8]:
import pandas as pd
import numpy as np

In [9]:
df1 = pd.read_csv(r'D:\Resume Classification System\data\raw\Dataset.csv')
df1.head()

   Unnamed: 0    Category                                               Text
0           0  Accountant  ﻿________________\r\n\r\nEDUCATION\r\nOMBA - E...
1           1  Accountant  ﻿________________\r\n\r\nHOWARD GERRARD\r\nAcc...
2           2  Accountant  ﻿________________\r\n\r\nKevin Frank\r\nSENIOR...
3           3  Accountant  ﻿________________\r\n\r\nPlace of birth\r\nNat...
4           4  Accountant  ﻿________________\r\n\r\nStephen Greet, CPA\r\...

In [10]:
df1 = df1.drop('Unnamed: 0',axis=1)

In [11]:
df1.head()

     Category                                               Text
0  Accountant  ﻿________________\r\n\r\nEDUCATION\r\nOMBA - E...
1  Accountant  ﻿________________\r\n\r\nHOWARD GERRARD\r\nAcc...
2  Accountant  ﻿________________\r\n\r\nKevin Frank\r\nSENIOR...
3  Accountant  ﻿________________\r\n\r\nPlace of birth\r\nNat...
4  Accountant  ﻿________________\r\n\r\nStephen Greet, CPA\r\...

In [12]:
df2 = pd.read_csv(r'D:\Resume Classification System\data\raw\github_categorized.csv')
df2.head()

   Unnamed: 0      Category                                               Text
0           0   AI Engineer  Abhishek kumar\nartificial intelligence and ma...
1           2  Data Analyst  DATA ANALYST F/H\n\nArailym PERNEBAY\n\nperneb...
2           3  Data Analyst  # CV 4: Cybersecurity Analyst\n**Name**: Emily...
3           4  Data Analyst  Name: Ravi Kumar\nContact: ravi.k@email.com | ...
4           5  Data Analyst  Title: Top Analyst Reports for Bank of America...

In [13]:
df2 = df2.drop('Unnamed: 0',axis=1)

In [14]:
df2.head()

       Category                                               Text
0   AI Engineer  Abhishek kumar\nartificial intelligence and ma...
1  Data Analyst  DATA ANALYST F/H\n\nArailym PERNEBAY\n\nperneb...
2  Data Analyst  # CV 4: Cybersecurity Analyst\n**Name**: Emily...
3  Data Analyst  Name: Ravi Kumar\nContact: ravi.k@email.com | ...
4  Data Analyst  Title: Top Analyst Reports for Bank of America...

In [16]:
df3 = pd.read_csv(r'D:\Resume Classification System\data\raw\synthetic_dataset.csv')
df3.head()

   Unnamed: 0     Category                                               Text
0           0  AI Engineer  Name: Eleanor Vance\n\nSummary:\nHighly motiva...
1           1  AI Engineer  JOHN SMITH\n(123) 456-7890 | john.smith@email....
2           2  AI Engineer  [Name] Anya Sharma\n[Phone] (555) 123-4567\n[E...
3           3  AI Engineer  Jane Doe\n(123) 456-7890 | jane.doe@email.com ...
4           4  AI Engineer  Jane Doe\n(123) 456-7890 | jane.doe@email.com ...

In [ ]:
df3 = df3.drop("Unnamed: 0",axis=1)

In [ ]:
df3.head()

      Category                                               Text
0  AI Engineer  Name: Eleanor Vance\n\nSummary:\nHighly motiva...
1  AI Engineer  JOHN SMITH\n(123) 456-7890 | john.smith@email....
2  AI Engineer  [Name] Anya Sharma\n[Phone] (555) 123-4567\n[E...
3  AI Engineer  Jane Doe\n(123) 456-7890 | jane.doe@email.com ...
4  AI Engineer  Jane Doe\n(123) 456-7890 | jane.doe@email.com ...

In [ ]:
print(df1.columns)
print(df2.columns)
print(df3.columns)

Index(['Category', 'Text'], dtype='object')
Index(['Category', 'Text'], dtype='object')
Index(['Category', 'Text'], dtype='object')

In [ ]:
print(df1['Category'].unique())
print(df2['Category'].unique())
print(df3['Category'].unique())

['Accountant' 'Advocate' 'Agriculture' 'Apparel' 'Architecture' 'Arts'
 'Automobile' 'Aviation' 'Banking' 'Blockchain' 'BPO'
 'Building and Construction' 'Business Analyst' 'Civil Engineer'
 'Consultant' 'Data Scientist' 'Database' 'Designing' 'DevOps'
 'Digital Media' 'DotNet Developer' 'Education' 'Electrical Engineering'
 'ETL Developer' 'Finance' 'Food and Beverages' 'Health and Fitness'
 'Human Resources' 'Information Technology' 'Java Developer' 'Management'
 'Mechanical Engineer' 'Network Security Engineer' 'Operations Manager'
 'PMO' 'Public Relations' 'Python Developer' 'React Developer' 'Sales'
 'SAP Developer' 'SQL Developer' 'Testing' 'Web Designing']
['AI Engineer' 'Data Analyst' 'Data Scientist' 'ML Engineer']
['AI Engineer' 'Computer Vision Engineer' 'Data Analyst' 'Data Engineer'
 'NLP Engineer']

In [ ]:
print(df1.dtypes)
print(df2.dtypes)
print(df3.dtypes)

Category    object
Text        object
dtype: object
Category    object
Text        object
dtype: object
Category    object
Text        object
dtype: object

In [ ]:
df1_shuffled = df1.sample(frac=1, random_state=42).reset_index(drop=True)
df2_shuffled = df2.sample(frac=1, random_state=42).reset_index(drop=True)
df3_shuffled = df3.sample(frac=1, random_state=42).reset_index(drop=True)

In [ ]:
combined_df = pd.concat([df1_shuffled, df2_shuffled, df3_shuffled], ignore_index=True)

In [ ]:
final_shuffled_df = combined_df.sample(frac=1).reset_index(drop=True)

In [ ]:
final_shuffled_df.head()

             Category                                               Text
0           Designing  ﻿________________\r\n\r\nJESSICA CLAIRE\r\nMon...
1          Accountant  ﻿________________\r\n\r\nJESSICA CLAIRE\r\nMon...
2       SQL Developer  ﻿________________\r\n\r\nJESSICA CLAIRE\r\n9\r...
3  Operations Manager  ﻿________________\r\n\r\nJESSICA CLAIRE\r\nres...
4             Finance  ﻿________________\r\n\r\nJESSICA CLAIRE\r\n100...

In [ ]:
final_shuffled_df.tail()

NameError: name 'final_shuffled_df' is not defined

In [ ]:
final_shuffled_df.to_csv(r'D:\Resume Classification System\data\processed\Combined_Data.csv')